HarryZeng/STM32F0_LPROX10/MDK-ARM/main.c
		nvic_init_structure.NVIC_IRQChannel = TIM14_IRQn;                //使能TIM14中断通道  
    nvic_init_structure.NVIC_IRQChannelCmd = ENABLE;                //使能TIM14中断  
    nvic_init_structure.NVIC_IRQChannelPriority = 1;                //优先级为4
    NVIC_Init(&nvic_init_structure); 	

    TIM_TimeBaseStructInit(&timer_init_structure);                  //初始化TIM结构体  
  
    timer_init_structure.TIM_ClockDivision = TIM_CKD_DIV1;          //系统时钟,不分频,24M  
    timer_init_structure.TIM_CounterMode = TIM_CounterMode_Up;      //向上计数模式  
    timer_init_structure.TIM_Period = 1000;                          //每300 uS触发一次中断,??ADC  
    timer_init_structure.TIM_Prescaler = 23;                      //计数时钟分频,f=1M,systick=1 uS  
    timer_init_structure.TIM_RepetitionCounter = 0x00;              //发生0+1的update事件产生中断 
		
    TIM_TimeBaseInit(TIM14, &timer_init_structure);  
		//TIM_ITConfig(TIM14, TIM_IT_Update, ENABLE);                      //使能TIM14中断
    //TIM_Cmd(TIM14, ENABLE);                                          //使能TIM14
}


void GPIO_INIT(void)
{
	
	    GPIO_InitTypeDef gpio_init_structure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA|RCC_AHBPeriph_GPIOB|RCC_AHBPeriph_GPIOF, ENABLE);  
  
    GPIO_StructInit(&gpio_init_structure);  
                                                        //PA-0~3??ADC  
    gpio_init_structure.GPIO_Pin = OUT_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                   //????(??)??  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                 //????  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    //??  
    GPIO_Init(OUT_GPIO_Port, &gpio_init_structure);  
	
		gpio_init_structure.GPIO_Pin = SW1_LD_Pin;
		gpio_init_structure.GPIO_Mode = GPIO_Mode_IN;                   //????(??)??  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
		gpio_init_structure.GPIO_PuPd= GPIO_PuPd_UP;                    //??
    GPIO_Init(SW1_LD_GPIO_Port, &gpio_init_structure); 
	
		gpio_init_structure.GPIO_Pin = SW1_ONOFF_Pin;
		gpio_init_structure.GPIO_Mode = GPIO_Mode_IN;                   //????(??)??  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
		gpio_init_structure.GPIO_PuPd= GPIO_PuPd_UP;                    //??
    GPIO_Init(SW1_ONOFF_GPIO_Port, &gpio_init_structure);  
	
    gpio_init_structure.GPIO_Pin = ALM_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                   //????(??)??  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                 //????  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    //??  
    GPIO_Init(ALM_GPIO_Port, &gpio_init_structure);  
	
		gpio_init_structure.GPIO_Pin = SC_Pin;
		gpio_init_structure.GPIO_Mode = GPIO_Mode_IN;                   //????(??)??  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
		gpio_init_structure.GPIO_PuPd= GPIO_PuPd_UP;                    //??
    GPIO_Init(SC_GPIO_Port, &gpio_init_structure);  

}

void GPIO_DEINIT_ALL(void)
{
	
	   GPIO_InitTypeDef gpio_init_structure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA|RCC_AHBPeriph_GPIOB|RCC_AHBPeriph_GPIOF, ENABLE);  
  
    GPIO_StructInit(&gpio_init_structure);  
                                                        //PA-0~3??ADC  
    gpio_init_structure.GPIO_Pin = GPIO_Pin_7;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                   //????(??)??  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                 //????  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_DOWN;                    //??  
    GPIO_Init(GPIOA, &gpio_init_structure); 
	
}


void RCC_Configuration(void)
{
	RCC_PLLConfig(RCC_PLLSource_HSI,RCC_PLLMul_6);
	RCC_PLLCmd(ENABLE);
	RCC_ADCCLKConfig(RCC_ADCCLK_PCLK_Div2);
	while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY)==RESET)
	{
		
	}
	
	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
	
	while(RCC_GetSYSCLKSource()!=0x08)
	{
	}
}

/**
  * @brief Configures EXTI Lines.
  * @param None
  * @retval None
  */
void EXTI_Configuration(void)
{
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Configure EXTI Line16(PVD Output) to generate an interrupt on rising and
     falling edges */
  EXTI_ClearITPendingBit(EXTI_Line16); 
  EXTI_InitStructure.EXTI_Line = EXTI_Line16;// PVD连接到中断16线上 
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;//使用中断模式
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;//电压下降到设定阈值时产生中断
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;// 使能中断
  EXTI_Init(&EXTI_InitStructure);// 初始化
}

/**
  * @brief Configures NVIC and Vector Table base location.
  * @param None
  * @retval None
  */
void NVIC_Configuration(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;
  
  /* Configure one bit for preemption priority */
  //NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);//中断优先级配置
  
  /* Enable the PVD Interrupt */ //设置PVD中断
  NVIC_InitStructure.NVIC_IRQChannel = PVD_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;                //使能PVD中断  
	NVIC_InitStructure.NVIC_IRQChannelPriority = 10;                //优先级为10
  NVIC_Init(&NVIC_InitStructure);
}

void PVD_init(void)
{
	EXTI_Configuration();
	
	NVIC_Configuration();
	
	//RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
	PWR_PVDLevelConfig(PWR_PVDLevel_7); /*设置PVD电压检测*/
	PWR_PVDCmd(ENABLE);
}


void DelaymsSet(int16_t ms)
{
		while(1)
		{
			ms--;
			if(ms<=0)
				break;
		}
}

uint8_t CheckFLag=0;

/*************************************************************/
#define 	FLASH_START_ADDR1 	 						0x08007000    //0x0800FFF0

uint8_t* UID=(uint8_t*)0x1FFFF7AC;  //获取UID  stm32f0:0x1FFFF7AC,stm32f100:0x1FFFF7E8
uint32_t Fml_Constant 	= 0x19101943;//输入到公式的常熟
uint8_t *C= (uint8_t*)&Fml_Constant;//把常量转化成数组
uint8_t FormulaResult[4];
uint32_t FormulaCheck;
uint32_t UIDFlashResult;
uint16_t Fml_CRC16;
uint8_t D[12];
int ProgramCounter=0;

void Formula_100(uint8_t *D,uint8_t *Result)
{
	D[0] = UID[4];
	D[1] = UID[8];
	D[2] = UID[1];
	D[3] = UID[3];
	D[4] = UID[0];
	D[5] = UID[5];
	D[6] = UID[10];
	D[7] = UID[7];
	D[8] = UID[9];
	D[9] = UID[2];
	D[10] = UID[11];
	D[11] = UID[6];
	
	Result[0] = C[0] ^ D[0];
	Result[1] = C[1] ^ D[6] ^ D[7] ^ D[8] ^ D[9] ^ D[10] ^ D[11] ;
	Result[2] = C[2] ^ D[4] ;
	Result[3] = C[3] ^ D[2] ^ D[1];
}

uint8_t FlashCheck(void)
{
		uint8_t FlashFlag;
		Formula_100(D,FormulaResult);
		FormulaCheck = FormulaResult[0]+(FormulaResult[1]<<8)+(FormulaResult[2]<<16)+(FormulaResult[3]<<24);
		//UIDFlashResult = *(__IO uint32_t*)(FLASH_START_ADDR1);
		UIDFlashResult = *(uint32_t*)(FLASH_START_ADDR1);
		if(UIDFlashResult==FormulaCheck)
			FlashFlag =1;
		else
			FlashFlag =0;
		
		return FlashFlag;
}

uint16_t Formula_CRC16(uint8_t *p,uint8_t len)
{
	uint8_t i;
	while(len--)
	{
		for(i=0x80; i!=0; i>>=1)
		{
			if((Fml_CRC16 & 0x8000) != 0)
			{
				Fml_CRC16 <<= 1;
				Fml_CRC16 ^= 0x1021;
			}
			else
			{
				Fml_CRC16 <<= 1;
			}
			if((*p&i)!=0)
			{
				Fml_CRC16 ^= 0x1021;
			}
		}
		p++;
	}
	return Fml_CRC16;
}
//void ProgramCheck(void)
//{
//	ProgramCounter 		= ReadFlash(ProgramRUNcounter_Mode_FLASH_DATA_ADDRESS);
//	if(ProgramCounter>65535 || ProgramCounter<0)
//	{
//		ProgramCounter = 0;
//		ResetParameter();
//	}
//	ProgramCounter = ProgramCounter+1;
//	WriteFlash(ProgramRUNcounter_Mode_FLASH_DATA_ADDRESS,ProgramCounter);
//	DelaymsSet(50); 	
//	if(ProgramCounter<=1)
//	{
//		ResetParameter();
//	}
//}
void ProgramCheck(void)
{
	ProgramCounter 		= *(__IO uint32_t*)(ProgramRUNcounter_Mode_FLASH_DATA_ADDRESS);
	if(ProgramCounter == 0xFFFFFFFF)
	{
		ResetParameter();
		WriteFlash(ProgramRUNcounter_Mode_FLASH_DATA_ADDRESS, 0x0505);
	}
	DelaymsSet(50);
}



void IWDG_Config(void)
{
	if(RCC_GetFlagStatus(RCC_FLAG_IWDGRST) != RESET)
	{
		RCC_ClearFlag();
	}
	
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
	IWDG_SetPrescaler(IWDG_Prescaler_64);
	IWDG_SetReload(40000/20);
	IWDG_ReloadCounter();
	
	IWDG_Enable();
}

void PVD_IRQHandler(void)
{
//	if(EXTI_GetITStatus(EXTI_Line16) != RESET)
//	{
//		PVD_Flag = 1;
//		/* Clear the Key Button EXTI line pending bit */
//		EXTI_ClearITPendingBit(EXTI_Line16);
//	}
	if(PWR_GetFlagStatus(PWR_FLAG_PVDO)!=RESET)
	{
		PVD_Flag = 1;
	}
	else
	{
		PVD_Flag = 0;
	}
}

/***************主函数***************/
/*SYS Clokc 24MHz ADC clock 12MHz*/
int main(void)
{
		uint32_t checkcouter;
		RCC_Configuration();
		GPIO_INIT();
		BSP_init();
		RCC_GetClocksFreq(&SysClock);
		DelaymsSet(5000); 
		IWDG_Config();
		CheckFLag = FlashCheck();
	  
	  
		if(CheckFLag)
		//if(1)
		{
			/*程序运行次数检测*/
			ProgramCheck();
			/*主要运行函数*/
			DataProcess();
		}
		else
			while(1)
			{
				checkcouter++;
			}	
}

